transport_routes_dst = [
    ("Одеса", "Білгород-Дністровський", 80),
    ("Одеса", "Ізмаїл", 140),
    ("Одеса", "Овідіополь", 45),
    ("Одеса", "Подільськ", 60),
    ("Ізмаїл", "Болград", 70),
    ("Подільськ", "Роздільна", 70),
    ("Білгород-Дністровський", "Роздільна", 110),
    ("Овідіополь", "Роздільна", 85),
    ("Болград", "Подільськ", 85),
    ("Одеса", "Чорноморськ", 20),
    ("Одеса", "Южне", 15),
    ("Чорноморськ", "Южне", 25),
    ("Ізмаїл", "Арциз", 35),
    ("Арциз", "Білгород-Дністровський", 60),
    ("Чорноморськ", "Овідіополь", 55),
]

transport_routes = [route[:2] for route in transport_routes_dst]
locations = {city for route in transport_routes for city in route}
